In [1]:
import pandas as pd

 Make sure the Pandas library is installed and imported in the notebook

In [9]:
brand = pd.Series(['Infinity','Lexus','Ford'])
brand

0    Infinity
1       Lexus
2        Ford
dtype: object

In [10]:
color = pd.Series(['Black','White','Grey'])
color

0    Black
1    White
2     Grey
dtype: object

In [11]:
My_Cars = pd.DataFrame({'Cars':brand , "color":color })
My_Cars

       Cars  color
0  Infinity  Black
1     Lexus  White
2      Ford   Grey

<i>Now Import CSV and Try to Manipulate Data using Pandas</i>

In [12]:
Car_sales = pd.read_csv("./data/car-sales.csv")
Car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

![](./images/pandas-anatomy-of-a-dataframe.png){width=100px height=50px}